import React, {ReactElement, useContext} from 'react';
import {ThemeContext} from '@styles/base';
import {IconProps} from '@types';
import Svg, {G, Path, Rect} from 'react-native-svg';

const LogoIcon = (props: IconProps): ReactElement => {
	const {colors} = useContext(ThemeContext);
	const scale = props.scale || 1;
	const color = props.color || colors.FONT_SECOND;
 
	return (
		<Svg width={12 * scale} height={12 * scale} viewBox="0 0 12 12">
			<Path id="Контур_488" data-name="Контур 488" d="M12,0H1.393L0,1.2V8.063H.2l3.8,3.148,0,.006L4.936,12H5.988l4.247-3.6-.008-.009L12,6.889ZM.7,1.521,1.43.9V6.375H1.393L.7,6.967ZM4.59,10.79.9,7.728l.758-.65h0l3.693,3.06ZM5.73,11.3H5.189l-.056-.047.763-.656H6.56ZM11.3,6.564,7.371,9.891H6.15L2.133,6.561V.7H11.3Z" fill={color}/>
			<G id="Сгруппировать_314" data-name="Сгруппировать 314" transform="translate(3.277 2.5)">
				<Path id="Контур_489" data-name="Контур 489" d="M141.57,107.956a.531.531,0,0,0-.273-.177.453.453,0,0,0,.217-.194.545.545,0,0,0,.072-.27.561.561,0,0,0-.033-.188.539.539,0,0,0-.092-.164.474.474,0,0,0-.144-.117.4.4,0,0,0-.19-.045h-1.166v2.01h.988a1.264,1.264,0,0,0,.279-.03.734.734,0,0,0,.231-.092.439.439,0,0,0,.212-.393A.527.527,0,0,0,141.57,107.956Zm-1.057-.686h.393a.136.136,0,0,1,.093.035.151.151,0,0,1,.04.117.14.14,0,0,1-.047.125.182.182,0,0,1-.1.031h-.376Zm.551,1.033a.164.164,0,0,1-.115.042h-.436v-.337h.456a.125.125,0,0,1,.1.05.191.191,0,0,1,.04.123A.156.156,0,0,1,141.063,108.3Z" transform="translate(-139.961 -106.8)" fill={color}/>
			</G>
			<G id="Сгруппировать_316" data-name="Сгруппировать 316" transform="translate(4.981 2.5)">
				<Path id="Контур_490" data-name="Контур 490" d="M214,106.8h-.447l-.75,2.01h.586l.119-.393h.535l.122.393h.583Zm-.41,1.248.187-.674.178.674Z" transform="translate(-212.802 -106.8)" fill={color}/>
			</G>
			<G id="Сгруппировать_318" data-name="Сгруппировать 318" transform="translate(6.913 2.483)">
				<Path id="Контур_491" data-name="Контур 491" d="M296.837,107.252a.464.464,0,0,0-.122-.168.778.778,0,0,0-.191-.12,2.063,2.063,0,0,0-.25-.093l-.157-.048a.913.913,0,0,1-.117-.041.242.242,0,0,1-.074-.047.088.088,0,0,1-.025-.065.079.079,0,0,1,.044-.076.258.258,0,0,1,.117-.023.617.617,0,0,1,.185.03,1.6,1.6,0,0,1,.171.064,1.552,1.552,0,0,1,.175.091l.238-.456q-.068-.034-.153-.072a1.942,1.942,0,0,0-.183-.071,1.731,1.731,0,0,0-.2-.054,1.081,1.081,0,0,0-.215-.021.912.912,0,0,0-.284.044.741.741,0,0,0-.239.129.6.6,0,0,0-.166.212.675.675,0,0,0-.061.294.589.589,0,0,0,.03.2.424.424,0,0,0,.092.151.62.62,0,0,0,.159.119,1.475,1.475,0,0,0,.229.1q.091.031.171.054t.143.045a.325.325,0,0,1,.1.052.091.091,0,0,1,.035.072.074.074,0,0,1-.035.064.237.237,0,0,1-.126.024.818.818,0,0,1-.234-.034,1.463,1.463,0,0,1-.205-.076,1.657,1.657,0,0,1-.207-.11l-.238.484a1.407,1.407,0,0,0,.2.1,2.018,2.018,0,0,0,.221.074,1.957,1.957,0,0,0,.231.048,1.562,1.562,0,0,0,.226.017,1.194,1.194,0,0,0,.276-.033.74.74,0,0,0,.246-.106.546.546,0,0,0,.175-.2.634.634,0,0,0,.066-.3A.61.61,0,0,0,296.837,107.252Z" transform="translate(-295.241 -106.08)" fill={color}/>
			</G>
			<G id="Сгруппировать_320" data-name="Сгруппировать 320" transform="translate(8.77 2.5)">
				<Path id="Контур_492" data-name="Контур 492" d="M375.593,108.328v-.317h.73v-.447h-.73v-.283h.855V106.8h-1.407v2.01h1.432v-.481Z" transform="translate(-375.041 -106.8)" fill={color}/>
			</G>
			<G id="Сгруппировать_322" data-name="Сгруппировать 322" transform="translate(3.571 5.581)">
				<G id="Сгруппировать_321" data-name="Сгруппировать 321" transform="translate(0 0)">
					<Rect id="Прямоугольник_88" data-name="Прямоугольник 88" width="6" fill={color}/>
				</G>
			</G>
		</Svg>
	);
};

export default LogoIcon;
